/* 

Call Stack হচ্ছে V8 ইঞ্জিনের মধ্যে থাকা একটা ডাটা স্ট্রাকচার যেখানে মূলত একটা ট্র্যাকিং থাকে যে এই মুহূর্তে আপনার প্রোগ্রামের কোন ফাংশন এক্সিকিউট হচ্ছে। বলে রাখা ভালো V8 ইঞ্জিনের দুটো মুল অংশের মধ্যে এই কল স্ট্যাক একটা আর মেমোরি ম্যানেজমেন্টের জন্য হিপ একটা।

Event Loop 
ব্রাউজারের জাভাস্ক্রিপ্ট রানটাইম এর মধ্যে একটি ম্যাসেজ কিউ বা কলব্যাক কিউ থাকে। এর কিউ এর মধ্যে থাকে কিছু ম্যাসেজ এবং তার সাথে সম্পৃক্ত কলব্যাক ফাংশন। যখনি কোন ইভেন্ট ঘটে যেমন মাউস ক্লিক, একটা রিকোয়েস্টের রেসপন্স বা এমনকি একটা সেটটাইম আউটের টাইমারের সমাপ্তি; তখনি একটা ম্যাসেজ বা কলব্যাক সেই কিউ এর মধ্যে জমা হয়। এরপর ইভেন্ট লুপ সেই কিউ থেকে প্রথম কলব্যাকটি তুলে নেয় এবং V8 এর কল স্ট্যাকে জম করে। আর যদি সেই ফাংশনটি ওই মুহূর্তে কল স্ট্যাকের উপড়ে থাকে তাহলে V8 সেটাকে সাধারণ ভাবে এক্সিকিউট করে ফেলে।

click ইভেন্ট ফায়ার করে তখন ম্যাসেজ কিউয়ের মধ্যে একটি ম্যাসেজ এবং সাথে একটি কলব্যাক (changeColor) জমা হয়। এরপর ইভেন্ট লুপ (যা কিনা একটি সেমি ইনফাইনাইট লুপ) এই কিউয়ের মধ্যে থাকা ম্যাসেজকে ডিকিউ করে বা বের করে আনে এবং কল স্ট্যাক তথা মুল জাভাস্ক্রিপ্ট ইঞ্জিনের দায়িত্বে ছেড়ে দেয়। আর কল স্ট্যাক ফ্রি থাকলে সেটাকে পাওয়া মাত্রই এক্সিকিউট করে ফেলে।




*/